** solution
#+name: create tables
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes
DROP TABLE DataBase1;
DROP TABLE DataBase2;
DROP TABLE BdSQL;

CREATE TABLE DataBase1 (
       Date INTEGER, -- epoch
       Company INTEGER,
       User_Notion INTEGER,
       Notion INTEGER, -- foreign key
       FOREIGN KEY(Notion) REFERENCES DataBase2(Notion)
);

CREATE TABLE DataBase2 (
       Notion INTEGER PRIMARY KEY,
       Address TEXT
);

CREATE TABLE BDSQL (
       Idfk INTEGER,
       FOREIGN KEY(Idfk) REFERENCES Database2(Id)
);

INSERT INTO DataBase1 VALUES(2147483640, 2, 1, 1);
INSERT INTO DataBase1 VALUES(2147483641, 2, 1, 1);
INSERT INTO DataBase1 VALUES(2147483642, 2, 1, 1);
INSERT INTO DataBase2 VALUES(1, 'Street1');

# -- Create unique key in DataBase1
ALTER TABLE DataBase1 ADD COLUMN Id INTEGER;
UPDATE DataBase1
    SET Id = (
        SELECT COUNT(*)
        FROM DataBase1 AS t
        WHERE t.rowid <= DataBase1.rowid
    );
# -- update BDSQL with new references to DataBase1
INSERT INTO BDSQL
       SELECT Id
            FROM DataBase1 AS t
            WHERE t.Date >= 2147483641;
# -- test
SELECT * FROM DataBase1;
SELECT Null;
SELECT * FROM DataBase2;
SELECT Null;
SELECT * FROM BDSQL;

#+end_src

#+RESULTS: create tables
|       Date | Company | User_Notion | Notion | Id |
|------------+---------+-------------+--------+----|
| 2147483640 |       2 |           1 |      1 |  1 |
| 2147483641 |       2 |           1 |      1 |  2 |
| 2147483642 |       2 |           1 |      1 |  3 |
|       Null |         |             |        |    |
|            |         |             |        |    |
|     Notion | Address |             |        |    |
|          1 | Street1 |             |        |    |
|       Null |         |             |        |    |
|            |         |             |        |    |
|       Idfk |         |             |        |    |
|          2 |         |             |        |    |
|          3 |         |             |        |    |

** solution
Task: write documentation and correct mistakes and bugs, demonstate
 documentation skills.

Plan:
1) run code
2) fix errors
3) add comments
4) linting
5) write report about found errors and all changes


Final result:
#+begin_src python :results output :exports both :session s1
import sqlite3
print(sqlite3.version)
#+end_src

#+RESULTS:
: 2.6.0

Solution:
#+begin_src python :results output :exports both :session s1
""" This program is a task from "Step By Step" copmany for job Machine
Learning Engineer.  This is modified version with fixed errors, added
comments and type hints.

"""

import sqlite3
from sqlite3 import Connection
import sys

def connect_to_db(db_name) -> None | Connection:
    "Create connection to a database file in current directory."
    try:
        conn = sqlite3.connect(db_name)
        return conn
    except Exception as e:
        print(f"An error occurred: {e}")
    return None

def create_table(conn: Connection):
    "Create table users."
    cursor = conn.cursor()
    cursor.execute("""CREATE TABLE users(
                    id INTEGER PRIMARY KEY AUTOINCREMENT,
                    name TEXT NOT NULL,
                    age INTEGER)""")
    conn.commit()

def insert_user(conn: Connection, user_name: str, user_age: int):
    "Insert row to users table."
    cursor = conn.cursor()
    cursor.execute("INSERT INTO users (name, age) VALUES (?, ?)",
                   (user_name, user_age))
    conn.commit()

def creat_and_fill_users(db_name: str):
    "Create table users and insert one row."
    # Usage example
    db_connection = connect_to_db(db_name)
    if db_connection is None:
        sys.exit(1)
    create_table(db_connection)
    insert_user(db_connection, 'Alice', 30)

def test_drop(db_name: str, table_name: str):
    "Drop table if exist."
    db_connection = connect_to_db(db_name)
    cur = db_connection.cursor()
    cur.execute("DROP TABLE IF EXISTS " + table_name)

def test_select(db_name: str, table_name: str):
    "Select and print all rows from table."
    db_connection = connect_to_db(db_name)
    cur = db_connection.cursor()
    cur.execute("SELECT * FROM " + table_name)

    rows = cur.fetchall()
    for row in rows:
        print(row)


if __name__ == "__main__":
    DB_NAME_ARG = 'my_database.db'
    test_drop(DB_NAME_ARG, 'users')
    creat_and_fill_users(DB_NAME_ARG)
    test_select(DB_NAME_ARG, 'users')

#+end_src

#+RESULTS:
: (1, 'Alice', 30)

